; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	image2 - mode
	thermograph1 - mode
	infrared4 - mode
	infrared0 - mode
	infrared3 - mode
	infrared5 - mode
	Star5 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star5)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 image2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared0)
	(supports instrument4 image2)
	(supports instrument4 infrared5)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument5 infrared3)
	(supports instrument5 image2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 infrared5)
	(supports instrument6 infrared3)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star1)
	(supports instrument7 image2)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared5)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 infrared4)
	(calibration_target instrument9 GroundStation4)
	(calibration_target instrument9 GroundStation6)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite3 Phenomenon10)
	(have_image Phenomenon7 infrared0)
	(have_image Star8 infrared3)
	(have_image Phenomenon9 infrared5)
	(have_image Phenomenon9 thermograph1)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon11 infrared5)
	(have_image Planet12 infrared0)
	(have_image Planet12 infrared4)
	(have_image Planet13 thermograph1)
))

)

; plan
1. (turn_to satellite3 groundstation4 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 groundstation4)
   goals met: 0 of 11
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 11
3. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 0 of 11
4. (turn_to satellite2 phenomenon7 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon7)
   goals met: 0 of 11
5. (take_image satellite2 phenomenon7 instrument6 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 1 of 11
6. (turn_to satellite2 phenomenon11 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 11
7. (take_image satellite2 phenomenon11 instrument6 infrared5)
   added: (have_image phenomenon11 infrared5)
   goals met: 2 of 11
8. (turn_to satellite2 phenomenon10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 11
9. (turn_to satellite0 star5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star5)
   goals met: 2 of 11
10. (take_image satellite2 phenomenon10 instrument6 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 3 of 11
11. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 3 of 11
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 11
13. (calibrate satellite3 instrument9 groundstation4)
   added: (calibrated instrument9)
   goals met: 3 of 11
14. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 3 of 11
15. (turn_to satellite0 phenomenon9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 11
16. (take_image satellite0 phenomenon9 instrument0 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 4 of 11
17. (turn_to satellite0 planet13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet13)
   goals met: 4 of 11
18. (take_image satellite0 planet13 instrument0 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 5 of 11
19. (turn_to satellite0 star8 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star8)
   goals met: 6 of 11
20. (take_image satellite0 star8 instrument0 infrared3)
   added: (have_image star8 infrared3)
   goals met: 7 of 11
21. (turn_to satellite2 phenomenon9 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon9)
   goals met: 7 of 11
22. (take_image satellite2 phenomenon9 instrument6 infrared5)
   added: (have_image phenomenon9 infrared5)
   goals met: 8 of 11
23. (turn_to satellite2 planet12 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet12)
   goals met: 8 of 11
24. (take_image satellite2 planet12 instrument6 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 9 of 11
25. (turn_to satellite3 planet12 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 planet12)
   goals met: 9 of 11
26. (take_image satellite3 planet12 instrument9 infrared4)
   added: (have_image planet12 infrared4)
   goals met: 10 of 11
27. (turn_to satellite3 phenomenon10 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon10)
   goals met: 11 of 11
